import { calc } from "../helpers"

export const AnnualInterestRate = ({
  data1,
  data2,
  setI1,
  setI2,
  setData1,
  setData2
}) => {
  const процентнаяСтавкаГодовыхШаг = 0.1
  const процентнаяСтавкаГодовыхМакс = 30
  const процентнаяСтавкаГодовыхЗначение1 = data1?.процентнаяСтавкаГодовых
  const процентнаяСтавкаГодовыхЗначение2 = data2?.процентнаяСтавкаГодовых
  const процентнаяСтавкаГодовыхДействие1 = e => {
    calc({ процентнаяСтавкаГодовых: +e.target.value }, data1, setData1, 'data1')
    setI1(0)
  }
  const процентнаяСтавкаГодовыхДействие2 = e => {
    calc({ процентнаяСтавкаГодовых: +e.target.value }, data2, setData2, 'data2')
    setI2(0)
  }

  return (
    <tr>
      <td>Проц. ставка годовых</td>
      <td className="range-flex">
        <input
          type="range"
          step={процентнаяСтавкаГодовыхШаг}
          min={процентнаяСтавкаГодовыхШаг}
          max={процентнаяСтавкаГодовыхМакс}
          value={процентнаяСтавкаГодовыхЗначение1}
          onInput={процентнаяСтавкаГодовыхДействие1}
        />
        <span>
          { процентнаяСтавкаГодовыхЗначение1 }%
        </span>
      </td>
      <td className="range-flex">
        <input
          type="range"
          step={процентнаяСтавкаГодовыхШаг}
          min={процентнаяСтавкаГодовыхШаг}
          max={процентнаяСтавкаГодовыхМакс}
          value={процентнаяСтавкаГодовыхЗначение2}
          onInput={процентнаяСтавкаГодовыхДействие2}
        />
        <span>
          { процентнаяСтавкаГодовыхЗначение2 }%
        </span>
      </td>
    </tr>
  )
}
